{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 480, 640, 3], "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "name": "input_1"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "filters": 64, "name": "conv2d_1", "padding": "same", "trainable": true, "strides": [2, 2], "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [7, 7], "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_1"}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"center": true, "beta_constraint": null, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "name": "batch_normalization_1"}, "class_name": "BatchNormalization", "name": "batch_normalization_1"}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation", "name": "activation_1"}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [3, 3], "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "same", "trainable": true}, "class_name": "MaxPooling2D", "name": "max_pooling2d_1"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "filters": 64, "name": "conv2d_2", "padding": "same", "trainable": true, "strides": [1, 1], "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_2"}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"center": true, "beta_constraint": null, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "name": "batch_normalization_2"}, "class_name": "BatchNormalization", "name": "batch_normalization_2"}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation", "name": "activation_2"}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "filters": 64, "name": "conv2d_3", "padding": "same", "trainable": true, "strides": [1, 1], "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_3"}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["conv2d_3", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}, "class_name": "Add", "name": "add_1"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"center": true, "beta_constraint": null, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "name": "batch_normalization_3"}, "class_name": "BatchNormalization", "name": "batch_normalization_3"}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation", "name": "activation_3"}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "filters": 128, "name": "conv2d_4", "padding": "same", "trainable": true, "strides": [2, 2], "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_4"}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"center": true, "beta_constraint": null, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "name": "batch_normalization_4"}, "class_name": "BatchNormalization", "name": "batch_normalization_4"}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation", "name": "activation_4"}, {"inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "filters": 128, "name": "conv2d_6", "padding": "valid", "trainable": true, "strides": [2, 2], "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_6"}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "filters": 128, "name": "conv2d_5", "padding": "same", "trainable": true, "strides": [1, 1], "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_5"}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}], ["conv2d_5", 0, 0, {}]]], "config": {"name": "add_2", "trainable": true}, "class_name": "Add", "name": "add_2"}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"center": true, "beta_constraint": null, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "name": "batch_normalization_5"}, "class_name": "BatchNormalization", "name": "batch_normalization_5"}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "class_name": "Activation", "name": "activation_5"}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "filters": 256, "name": "conv2d_7", "padding": "same", "trainable": true, "strides": [2, 2], "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_7"}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"center": true, "beta_constraint": null, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "name": "batch_normalization_6"}, "class_name": "BatchNormalization", "name": "batch_normalization_6"}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "class_name": "Activation", "name": "activation_6"}, {"inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "filters": 256, "name": "conv2d_9", "padding": "valid", "trainable": true, "strides": [2, 2], "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_9"}, {"inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "filters": 256, "name": "conv2d_8", "padding": "same", "trainable": true, "strides": [1, 1], "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_8"}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}], ["conv2d_8", 0, 0, {}]]], "config": {"name": "add_3", "trainable": true}, "class_name": "Add", "name": "add_3"}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"center": true, "beta_constraint": null, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "name": "batch_normalization_7"}, "class_name": "BatchNormalization", "name": "batch_normalization_7"}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "class_name": "Activation", "name": "activation_7"}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "filters": 512, "name": "conv2d_10", "padding": "same", "trainable": true, "strides": [2, 2], "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_10"}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"center": true, "beta_constraint": null, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "name": "batch_normalization_8"}, "class_name": "BatchNormalization", "name": "batch_normalization_8"}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "class_name": "Activation", "name": "activation_8"}, {"inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "filters": 512, "name": "conv2d_12", "padding": "valid", "trainable": true, "strides": [2, 2], "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [1, 1], "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_12"}, {"inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "filters": 512, "name": "conv2d_11", "padding": "same", "trainable": true, "strides": [1, 1], "kernel_regularizer": {"config": {"l2": 9.999999747378752e-05, "l1": 0.0}, "class_name": "L1L2"}, "use_bias": true, "bias_regularizer": null, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_size": [3, 3], "kernel_constraint": null, "activation": "linear", "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D", "name": "conv2d_11"}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}], ["conv2d_11", 0, 0, {}]]], "config": {"name": "add_4", "trainable": true}, "class_name": "Add", "name": "add_4"}, {"inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"center": true, "beta_constraint": null, "axis": 3, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "gamma_constraint": null, "name": "batch_normalization_9"}, "class_name": "BatchNormalization", "name": "batch_normalization_9"}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "class_name": "Activation", "name": "activation_9"}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"strides": [1, 1], "pool_size": [15, 20], "data_format": "channels_last", "name": "average_pooling2d_1", "padding": "valid", "trainable": true}, "class_name": "AveragePooling2D", "name": "average_pooling2d_1"}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten", "name": "flatten_1"}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "bias_constraint": null, "units": 4, "use_bias": true, "activation": "sigmoid", "name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "normal", "seed": null, "scale": 2.0, "mode": "fan_in"}, "class_name": "VarianceScaling"}}, "class_name": "Dense", "name": "dense_1"}]}, "class_name": "Model"}