{"class_name": "Model", "keras_version": "2.2.4", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"sparse": false, "batch_input_shape": [null, 480, 640, 3], "name": "input_1", "dtype": "float32"}}, {"class_name": "Conv2D", "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"strides": [2, 2], "kernel_constraint": null, "padding": "same", "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_1", "bias_constraint": null, "kernel_size": [7, 7], "filters": 64, "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "scale": true, "center": true, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [3, 3], "padding": "same", "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Conv2D", "name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "same", "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_2", "bias_constraint": null, "kernel_size": [3, 3], "filters": 64, "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "scale": true, "center": true, "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "same", "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_3", "bias_constraint": null, "kernel_size": [3, 3], "filters": 64, "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}}}, {"class_name": "Add", "name": "add_1", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["conv2d_3", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "scale": true, "center": true, "name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_4", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"strides": [2, 2], "kernel_constraint": null, "padding": "same", "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_4", "bias_constraint": null, "kernel_size": [3, 3], "filters": 128, "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "scale": true, "center": true, "name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_6", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"strides": [2, 2], "kernel_constraint": null, "padding": "valid", "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_6", "bias_constraint": null, "kernel_size": [1, 1], "filters": 128, "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}}}, {"class_name": "Conv2D", "name": "conv2d_5", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "same", "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_5", "bias_constraint": null, "kernel_size": [3, 3], "filters": 128, "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}}}, {"class_name": "Add", "name": "add_2", "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["conv2d_5", 0, 0, {}]]], "config": {"name": "add_2", "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "scale": true, "center": true, "name": "batch_normalization_5", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_7", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"strides": [2, 2], "kernel_constraint": null, "padding": "same", "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_7", "bias_constraint": null, "kernel_size": [3, 3], "filters": 256, "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "scale": true, "center": true, "name": "batch_normalization_6", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_9", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"strides": [2, 2], "kernel_constraint": null, "padding": "valid", "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_9", "bias_constraint": null, "kernel_size": [1, 1], "filters": 256, "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}}}, {"class_name": "Conv2D", "name": "conv2d_8", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "same", "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_8", "bias_constraint": null, "kernel_size": [3, 3], "filters": 256, "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}}}, {"class_name": "Add", "name": "add_3", "inbound_nodes": [[["conv2d_9", 0, 0, {}], ["conv2d_8", 0, 0, {}]]], "config": {"name": "add_3", "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "scale": true, "center": true, "name": "batch_normalization_7", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_10", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"strides": [2, 2], "kernel_constraint": null, "padding": "same", "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_10", "bias_constraint": null, "kernel_size": [3, 3], "filters": 512, "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}}}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "scale": true, "center": true, "name": "batch_normalization_8", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "name": "conv2d_12", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"strides": [2, 2], "kernel_constraint": null, "padding": "valid", "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_12", "bias_constraint": null, "kernel_size": [1, 1], "filters": 512, "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}}}, {"class_name": "Conv2D", "name": "conv2d_11", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"strides": [1, 1], "kernel_constraint": null, "padding": "same", "activation": "linear", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_11", "bias_constraint": null, "kernel_size": [3, 3], "filters": 512, "use_bias": true, "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}}}, {"class_name": "Add", "name": "add_4", "inbound_nodes": [[["conv2d_12", 0, 0, {}], ["conv2d_11", 0, 0, {}]]], "config": {"name": "add_4", "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "axis": 3, "scale": true, "center": true, "name": "batch_normalization_9", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_constraint": null, "gamma_regularizer": null}}, {"class_name": "Activation", "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "config": {"name": "activation_9", "activation": "relu", "trainable": true}}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_1", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"strides": [1, 1], "pool_size": [15, 20], "padding": "valid", "trainable": true, "name": "average_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "name": "dense_1", "activation": "sigmoid", "trainable": true, "units": 4, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "distribution": "normal", "seed": null, "scale": 2.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}, "backend": "tensorflow"}