{"class_name": "Model", "keras_version": "2.2.4", "backend": "tensorflow", "config": {"output_layers": [["dense_1", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 480, 640, 3], "sparse": false, "dtype": "float32", "name": "input_1"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"kernel_size": [7, 7], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_1", "strides": [2, 2], "use_bias": true, "filters": 64, "activity_regularizer": null, "padding": "same", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "axis": 3, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [3, 3], "data_format": "channels_last", "strides": [2, 2], "padding": "same"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_2", "strides": [1, 1], "use_bias": true, "filters": 64, "activity_regularizer": null, "padding": "same", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "axis": 3, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_3", "strides": [1, 1], "use_bias": true, "filters": 64, "activity_regularizer": null, "padding": "same", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_1", "config": {"trainable": true, "name": "add_1"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["conv2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "axis": 3, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_4", "strides": [2, 2], "use_bias": true, "filters": 128, "activity_regularizer": null, "padding": "same", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "axis": 3, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_6", "strides": [2, 2], "use_bias": true, "filters": 128, "activity_regularizer": null, "padding": "valid", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_5", "strides": [1, 1], "use_bias": true, "filters": 128, "activity_regularizer": null, "padding": "same", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_2", "config": {"trainable": true, "name": "add_2"}, "inbound_nodes": [[["conv2d_6", 0, 0, {}], ["conv2d_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "axis": 3, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_7", "strides": [2, 2], "use_bias": true, "filters": 256, "activity_regularizer": null, "padding": "same", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "axis": 3, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_9", "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_9", "strides": [2, 2], "use_bias": true, "filters": 256, "activity_regularizer": null, "padding": "valid", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_8", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_8", "strides": [1, 1], "use_bias": true, "filters": 256, "activity_regularizer": null, "padding": "same", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_3", "config": {"trainable": true, "name": "add_3"}, "inbound_nodes": [[["conv2d_9", 0, 0, {}], ["conv2d_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "axis": 3, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_7", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_10", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_10", "strides": [2, 2], "use_bias": true, "filters": 512, "activity_regularizer": null, "padding": "same", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "axis": 3, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_8", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_12", "config": {"kernel_size": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_12", "strides": [2, 2], "use_bias": true, "filters": 512, "activity_regularizer": null, "padding": "valid", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_11", "config": {"kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "dilation_rate": [1, 1], "name": "conv2d_11", "strides": [1, 1], "use_bias": true, "filters": 512, "activity_regularizer": null, "padding": "same", "trainable": true, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "activation": "linear", "bias_constraint": null, "kernel_constraint": null, "bias_regularizer": null}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_4", "config": {"trainable": true, "name": "add_4"}, "inbound_nodes": [[["conv2d_12", 0, 0, {}], ["conv2d_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "axis": 3, "beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_9", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "name": "average_pooling2d_1", "config": {"name": "average_pooling2d_1", "trainable": true, "pool_size": [15, 20], "data_format": "channels_last", "strides": [1, 1], "padding": "valid"}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_in", "scale": 2.0, "distribution": "normal", "seed": null}}, "units": 4, "trainable": true, "name": "dense_1", "activation": "sigmoid", "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}]}}